MCHP-X2Cdemos/mc_foc_sl_fip_dsPIC33ck_mclv2.x/mcc_generated_files/adc1.h
inline static void ADC1_SoftwareTriggerEnable(void)
{
    ADCON3Lbits.SWCTRG = 1;
}
/**
  @Summary
    Allows software level-sensitive common trigger to be enabled manually

  @Description
    This routine is used to enable the ADC1 software level-sensitive common trigger manually
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function. 
 
  @Returns
    None

  @Param
    None
  
  @Example
*/

inline static void ADC1_SoftwareLevelTriggerEnable(void)
{
    ADCON3Lbits.SWLCTRG = 1;
}

/**
  Section: Interface Routines: Dedicated Core
*/
/**
  @Summary
    Enables power for Core 0 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 0.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example

*/

void ADC1_Core0PowerEnable(void);


/**

  @Summary
    Sets Core 0 channel

  @Description
    This routine is used to set the ADC1 Core 0 channel manually.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example

*/

inline static void ADC1_Core0ChannelSelect(ADC1_CORE0_CHANNEL channel)
{
   ADCON4Hbits.C0CHS = channel;
}
/**
  @Summary
    Returns the ADC1 conversion value for Core 0.

  @Description
    This routine is used to get the analog to digital converted value. This
    routine gets converted values from the channel specified.
 
  @Preconditions
    The core required must be enabled and calibrated before calling this routine 
    using ADC1_Core0PowerEnable() and ADC1_Core0Calibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsCore0ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */

inline static uint16_t ADC1_Core0ConversionResultGet(void) 
{
    return ADCBUF0;
}
/**
  @Summary
    Allows selection of a resolution mode for conversion

  @Description
    This routine is used to select desired resolution mode for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required resolution mode from the ADC1_RESOLUTION_TYPE list
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/

inline static void ADC1_Core0ResolutionModeSet( ADC1_RESOLUTION_TYPE resolution )
{
    ADCORE0Hbits.RES = resolution;
}
/**
  @Summary
    Returns the conversion status of core0 for conversion

  @Description
    This routine is used to return the conversion status of core0 selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Core Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool ADC1_IsCore0ConversionComplete(void)
{   
    return ADSTATLbits.AN0RDY;
}

/**
  @Summary
    Allows conversion clock prescaler value to be set

  @Description
    This routine is used to allow conversion clock prescaler value to be set manually
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required prescaler integer value
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static void ADC1_Core0ConversionClockPrescalerSet(uint8_t prescaler)
{
    ADCORE0Hbits.ADCS = prescaler;
}
/**
  @Summary
    Enables power for Core 1 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 1.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example

*/

void ADC1_Core1PowerEnable(void);


/**

  @Summary
    Sets Core 0 channel

  @Description
    This routine is used to set the ADC1 Core 1 channel manually.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example

*/

inline static void ADC1_Core1ChannelSelect(ADC1_CORE1_CHANNEL channel)
{
   ADCON4Hbits.C1CHS = channel;
}
/**
  @Summary
    Returns the ADC1 conversion value for Core 1.

  @Description
    This routine is used to get the analog to digital converted value. This
    routine gets converted values from the channel specified.
 
  @Preconditions
    The core required must be enabled and calibrated before calling this routine 
    using ADC1_Core1PowerEnable() and ADC1_Core1Calibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsCore1ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */

inline static uint16_t ADC1_Core1ConversionResultGet(void) 
{
    return ADCBUF1;
}
/**
  @Summary
    Allows selection of a resolution mode for conversion

  @Description
    This routine is used to select desired resolution mode for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required resolution mode from the ADC1_RESOLUTION_TYPE list
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/

inline static void ADC1_Core1ResolutionModeSet( ADC1_RESOLUTION_TYPE resolution )
{
    ADCORE1Hbits.RES = resolution;
}
/**
  @Summary
    Returns the conversion status of core1 for conversion

  @Description
    This routine is used to return the conversion status of core1 selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Core Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool ADC1_IsCore1ConversionComplete(void)
{   
    return ADSTATLbits.AN1RDY;
}

/**
  @Summary
    Allows conversion clock prescaler value to be set

  @Description
    This routine is used to allow conversion clock prescaler value to be set manually
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required prescaler integer value
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static void ADC1_Core1ConversionClockPrescalerSet(uint8_t prescaler)
{
    ADCORE1Hbits.ADCS = prescaler;
}
/**
  Section: Interface Routines: Shared Core
*/
/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);


/**
  @Summary
    Allows selection of a data format type for conversion

  @Description
    This routine is used to select desired data format for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required data format type from the ADC1_FORM_TYPE list
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_FormatDataSet( ADC1_FORM_TYPE form )
{
    ADCON1Hbits.FORM = form;
}
/**
  @Summary
    Allows selection of a resolution mode for conversion

  @Description
    This routine is used to select desired resolution mode for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required resolution mode from the ADC1_RESOLUTION_TYPE list
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_SharedCoreResolutionModeSet( ADC1_RESOLUTION_TYPE resolution )
{
    ADCON1Hbits.SHRRES = resolution;
}
/**
  @Summary
    Allows conversion clock prescaler value to be set

  @Description
    This routine is used to allow conversion clock prescaler value to be set manually
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    Pass in required prescaler integer value
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/
inline static void ADC1_SharedCoreConversionClockPrescalerSet(uint8_t prescaler)
{
    ADCON2Lbits.SHRADCS = prescaler;
}
/**
  @Summary
    Returns the ADC1 conversion value for the shared core channel AN19

  @Description
    This routine is used to get the analog to digital converted value for channel AN19. This
    routine gets converted values from the shared core channel AN19.
 
  @Preconditions
    The shared core must be enabled and calibrated before calling this routine 
    using ADC1_SharedCorePowerEnable() and ADC1_SharedCoreCalibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsSharedChannelAN19ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */
inline static uint16_t ADC1_SharedChannelAN19ConversionResultGet(void) 
{
    return ADCBUF19;
}
/**
  @Summary
    Returns the conversion status of shared channel AN19 selected for conversion

  @Description
    This routine is used to return the conversion status of the shared channel AN19 
    selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Channel AN19 Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool ADC1_IsSharedChannelAN19ConversionComplete(void)
{   
    return ADSTATHbits.AN19RDY;
}
/**
  Shared Channel ConversionResultGet and ConversionComplete APIs are only generated 
  for the AN channels selected in the MCC UI. To generate for a specific channel,
  please enable the Shared AN channel in the MCC UI.
*/
/**
  Section: Interface Routines: Digital Comparator
*/
/**
  @Summary
    Allows setting of a the enable bit for the digital comparator 0

  @Description
    This routine is used to enable the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator0Enable(void)
{
    ADCMP0CONbits.CMPEN = 1;
}
/**
  @Summary
    Allows setting of a the disable bit for the digital comparator 0

  @Description
    This routine is used to disable the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator0Disable(void)
{
    ADCMP0CONbits.CMPEN = 0;		
}
/**
  @Summary
    Allows setting of a the low threshold for the digital comparator 0

  @Description
    This routine is used to set the desired low threshold for the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator0LowThresholdSet(uint16_t threshold )
{
    ADCMP0LO = threshold;	
}
/**
  @Summary
    Allows setting of a the high threshold for the digital comparator 0

  @Description
    This routine is used to set the desired high threshold for the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator0HighThresholdSet(uint16_t threshold )
{
    ADCMP0HI = threshold;		
}
/**
  @Summary
    Returns the Comparator 0 status bit

  @Description
    This routine is used to get the status bit for the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static uint16_t ADC1_Comparator0EventStatusGet(void)
{
    return ADCMP0CONbits.STAT;    	
}
/**
  @Summary
    Returns the channel that generated Comparator 0 event 

  @Description
    This routine is used to get the ADC1 channel that generated the 
    event for the digital comparator 0
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/
inline static uint16_t ADC1_ComparatorEvent0ChannelGet(void)
{
    return ADCMP0CONbits.CHNL;    		
} 
/**
  @Summary
    Allows setting of a the enable bit for the digital comparator 1

  @Description
    This routine is used to enable the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator1Enable(void)
{
    ADCMP1CONbits.CMPEN = 1;
}
/**
  @Summary
    Allows setting of a the disable bit for the digital comparator 1

  @Description
    This routine is used to disable the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator1Disable(void)
{
    ADCMP1CONbits.CMPEN = 0;		
}
/**
  @Summary
    Allows setting of a the low threshold for the digital comparator 1

  @Description
    This routine is used to set the desired low threshold for the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator1LowThresholdSet(uint16_t threshold )
{
    ADCMP1LO = threshold;	
}
/**
  @Summary
    Allows setting of a the high threshold for the digital comparator 1

  @Description
    This routine is used to set the desired high threshold for the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator1HighThresholdSet(uint16_t threshold )
{
    ADCMP1HI = threshold;		
}
/**
  @Summary
    Returns the Comparator 1 status bit

  @Description
    This routine is used to get the status bit for the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static uint16_t ADC1_Comparator1EventStatusGet(void)
{
    return ADCMP1CONbits.STAT;    	
}
/**
  @Summary
    Returns the channel that generated Comparator 1 event 

  @Description
    This routine is used to get the ADC1 channel that generated the 
    event for the digital comparator 1
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/
inline static uint16_t ADC1_ComparatorEvent1ChannelGet(void)
{
    return ADCMP1CONbits.CHNL;    		
} 
/**
  @Summary
    Allows setting of a the enable bit for the digital comparator 2

  @Description
    This routine is used to enable the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator2Enable(void)
{
    ADCMP2CONbits.CMPEN = 1;
}
/**
  @Summary
    Allows setting of a the disable bit for the digital comparator 2

  @Description
    This routine is used to disable the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator2Disable(void)
{
    ADCMP2CONbits.CMPEN = 0;		
}
/**
  @Summary
    Allows setting of a the low threshold for the digital comparator 2

  @Description
    This routine is used to set the desired low threshold for the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator2LowThresholdSet(uint16_t threshold )
{
    ADCMP2LO = threshold;	
}
/**
  @Summary
    Allows setting of a the high threshold for the digital comparator 2

  @Description
    This routine is used to set the desired high threshold for the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator2HighThresholdSet(uint16_t threshold )
{
    ADCMP2HI = threshold;		
}
/**
  @Summary
    Returns the Comparator 2 status bit

  @Description
    This routine is used to get the status bit for the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static uint16_t ADC1_Comparator2EventStatusGet(void)
{
    return ADCMP2CONbits.STAT;    	
}
/**
  @Summary
    Returns the channel that generated Comparator 2 event 

  @Description
    This routine is used to get the ADC1 channel that generated the 
    event for the digital comparator 2
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/
inline static uint16_t ADC1_ComparatorEvent2ChannelGet(void)
{
    return ADCMP2CONbits.CHNL;    		
} 
/**
  @Summary
    Allows setting of a the enable bit for the digital comparator 3

  @Description
    This routine is used to enable the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator3Enable(void)
{
    ADCMP3CONbits.CMPEN = 1;
}
/**
  @Summary
    Allows setting of a the disable bit for the digital comparator 3

  @Description
    This routine is used to disable the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator3Disable(void)
{
    ADCMP3CONbits.CMPEN = 0;		
}
/**
  @Summary
    Allows setting of a the low threshold for the digital comparator 3

  @Description
    This routine is used to set the desired low threshold for the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator3LowThresholdSet(uint16_t threshold )
{
    ADCMP3LO = threshold;	
}
/**
  @Summary
    Allows setting of a the high threshold for the digital comparator 3

  @Description
    This routine is used to set the desired high threshold for the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    threshold value required
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static void ADC1_Comparator3HighThresholdSet(uint16_t threshold )
{
    ADCMP3HI = threshold;		
}
/**
  @Summary
    Returns the Comparator 3 status bit

  @Description
    This routine is used to get the status bit for the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
*/
inline static uint16_t ADC1_Comparator3EventStatusGet(void)
{
    return ADCMP3CONbits.STAT;    	
}
/**
  @Summary
    Returns the channel that generated Comparator 3 event 

  @Description
    This routine is used to get the ADC1 channel that generated the 
    event for the digital comparator 3
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    None

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/
inline static uint16_t ADC1_ComparatorEvent3ChannelGet(void)
{
    return ADCMP3CONbits.CHNL;    		
} 
#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_ADC1_H
    
/**
 End of File
*/
